---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FilterValueRule
source: html/c8c02bc8-5318-812c-e0f2-bc5dd5d2ad64.htm
---
# FilterValueRule Members

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.